class SpectralCore:
    def __init__(self):
        
        self._internal_state = None

    def run(self):
        raise NotImplementedError("T̸̛̛̛̯̮̫̗͈̲͗̔̾͋̓̿͋͒̉̀̄̍̓̋̾̈̑̈́͗͒̀̉̄̌͌̄͐̀͌́̓͑̿̈́̚̕̕̚͘͝͠͠ḩ̴̛̛̱̦̟͎̬͔̼͓͇̦͇̬̺̙̰̥͑̀̾͐͊̄̉̍̂̈́̌͆̆̉͋̐̈̂̊̈́̆͠͝͝ǐ̵̺̲̼̯̳̝̙̟͇̠̩͚̖͇͎̝̣̳̘͉̃͐̏̂͌̆̒s̶̨͙͖̙̯͈͇̭̤͉̳͍͇̘̗̓͆ ̸̡̨̡̛̛͔͓̜̖̥͔̫͉̩͇̹̣̊̇̍̂́̈̋͆̽́̇̇́͌͌͐̍͛̆̌̆̐͆̌̍̈́̒̒̍̄̎́̈͐̈͘̕͠͝͝͠ḿ̷̡̢̛̛̯͈̲̦̗̻̩̰̝͚̱̻̪͕͎̼̗̯̠̗̭͈̲̙̈̈́̄͗̈́̿̉̓̽́̈́́̌̔͊͌̀̊̈̀̓͑͂̆̅̐̊̚͜ę̶̨̛̛̰̖͙̤̹̻̝͇̥̫̯̗͉̺̣̻̦͉̜̖̭͎̤̙͈̥̱̈́̑̀̄̃̽͛̔̉͒̋̽̓̚ͅͅţ̶̳̬̻̀͛h̶̨̨̡̪̣͕̹̲͕̤̯̯̲̺͍̰͉̱̟̳͚͎̻̞̮͐́̈́̈́̋͌͗̍͜ͅo̵̧̲̝͕͙͕͇̍̒̉͑̂͛͗̀̀́͊̈́̈̈́͑͊̆́͗̕̕̚̕͘̕͜͠ͅͅḏ̸̡̧̛̤̰̟͙̣͇̫̞̥̯̯̣̲̳̲̻̪͍͓̬̠͕͈͉̣͙̬̳̪͈̺̦̹̺̤̰͖͍̻̦̝̮͆̒̅̏̀̾̒͛͒͒̔̂͊̿̔̓̐̏̆̏̆̄͐͆̌̉̒̀̔͌̍͂͊̒͆̓͘͝͝ͅ ̵̡̡̨̧̖̭̯̜̯̤̠̮͈͙͈͍͓̽̊͂̓̿͂̏̈́̆͑͑̑͌͆̎̑̌̉͆́̎̉̈́̽̎̂͒͐̍͌̑͌́̀̔̅̀́̎̉̄̽̅̚͝͝͝ỉ̷̡̛͙̱̭̥͍̘̹̦̪͙͉̩̘̞̦̝̪͔̖̰͉̮̼͓͚͇͗̈́̾́̈́͆̾̓͒̈́̊͐͑͐̀̍̿͋̇̽̓͛̃͌̿͊̂̇̌̈́͐̓̒͆̽̚̚͜͜͝ͅͅş̶̡̨̞̟̗̪̫̪͍̤̪͚̮̱̥̗̩̗̫̫̘̦̎̄̒͊͑̇̂͒͗̒̿͛̿̊̊͑̇̒͂̏̑̃̓̏̈́͊̾̕̕͘ ̶̡͎̭͉̫̘̣̙̱̣̣̰͚͇̲͕̹̘͕̦̭̳̲̠͕͓͈̣͇̤̤͇̠͍͑͜ͅͅr̷̢̢̦̱̘̰̙̹̣̣͍̩̜͙̟̼̼͍̥͓̮̘͇̫̤͓̳̭̀̊̀̈́̽͗́̽͂͒͛̅̑͒́̍̇̆́̌͌̒̔́́̈́͑̃̈́́͑͑̇̑̓̊͋̂͘͘̕͝͝͝͝͝͠͝ͅȩ̷̡̒̈́͜s̷̨̡̧̟̫̲̮̜̹͖̣̼̖̬̤̪̙̜͙͔̠͉̫̔̍̇͂̽͗̃̈̾̑̀̆̕̚ͅt̵̪̯̤̼̪̲̻̥̱͔̠̱̫̦̙̍̓̽͐̋ͅr̷̹̝͚̙̺̥͕̼̓̇͌̐̔͑͑́̚͠͠į̵̡̣̠̳̬͔̪̩͎͙̩̜͉̖̻̬̯͖̬̥̺̝͖̻̮͔͖͓͖̗̞͓͇͍̞̙̺̳͓͖̗̰̏̿̀̐͛̏̍̆̈́̓̽̕͝ͅc̴̡̯͇̩̪̟̱̐̐̋̇́̓̓̚ṯ̸̨̧̣͎͚̺̠͇͕̺͍̯̆̎̑̀̄̓̀́̾ͅe̴̗̭̺̮̙̰͎͓̤̐͒̈́̎͋̄́̏̓̐̽̌̋́͜͠d̵̦͍͖̠̻̙̲̝̻̮͎̜̬͖̮̘̮̜͖͍̣͎̹͇̤̰͖͈͕͉̺̦̜͎̈́͒̆̈́̀̏̀̏̀̂̓͌̇͒̄̔͒̎̍̇̀̂̃̎̃̕̚͘̕͘͜͝͠͝.̴̡̢̦̮̭̞̝̻̲̥̝̩̭̽")
